log/2015-03-18-13.20.34.log

Execute Anonymous

================================

FeatureUpgrades.doFeatureUpgrades12_11();

================================

31.0 APEX_CODE,DEBUG;APEX_PROFILING,DEBUG;CALLOUT,INFO;DB,INFO;VALIDATION,INFO;WORKFLOW,INFO
Execute Anonymous: FeatureUpgrades.doFeatureUpgrades12_11();
11:20:33.833 (833955268)|EXECUTION_STARTED
11:20:33.833 (833966351)|CODE_UNIT_STARTED|[EXTERNAL]|execute_anonymous_apex
11:20:33.974 (974683569)|METHOD_ENTRY|[1]|01po0000003nulZ|FeatureUpgrades.FeatureUpgrades()
11:20:33.992 (992386153)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.MetadataUtils()
11:20:33.992 (992483852)|METHOD_EXIT|[2]|MetadataUtils
11:20:33.992 (992531974)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.createService()
11:20:33.997 (997752912)|CONSTRUCTOR_ENTRY|[9]|01po0000003Oh7D|<init>()
11:20:33.998 (998200995)|CONSTRUCTOR_EXIT|[9]|01po0000003Oh7D|<init>()
11:20:33.998 (998230178)|CONSTRUCTOR_ENTRY|[11]|01po0000003Oh7D|<init>()
11:20:33.998 (998312296)|CONSTRUCTOR_EXIT|[11]|01po0000003Oh7D|<init>()
11:20:34.004 (1004583658)|METHOD_EXIT|[2]|01po0000003Oh7F|MetadataUtils.createService()
11:20:34.004 (1004605923)|METHOD_EXIT|[1]|FeatureUpgrades
11:20:34.004 (1004632492)|METHOD_ENTRY|[1]|01po0000003nulZ|FeatureUpgrades.doFeatureUpgrades12_11()
11:20:34.004 (1004820031)|METHOD_ENTRY|[10]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:20:34.033 (1033553467)|METHOD_ENTRY|[1]|01po0000000dllI|Utils.Utils()
11:20:34.037 (1037610545)|METHOD_EXIT|[1]|Utils
11:20:34.037 (1037646152)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.041 (1041630446)|METHOD_ENTRY|[1]|01po0000000dlkU|Constants.Constants()
11:20:34.047 (1047187531)|METHOD_EXIT|[1]|Constants
11:20:34.047 (1047212063)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.047 (1047229154)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.047 (1047244293)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.047 (1047258205)|METHOD_EXIT|[10]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:20:34.047 (1047304516)|METHOD_ENTRY|[11]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:20:34.050 (1050063916)|CONSTRUCTOR_ENTRY|[8870]|01po0000003Oh7D|<init>()
11:20:34.050 (1050212574)|CONSTRUCTOR_EXIT|[8870]|01po0000003Oh7D|<init>()
11:20:34.097 (1097940676)|CALLOUT_REQUEST|[8876]|<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header><SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata"><sessionId>00Do0000000HyRH!AQYAQN8haRiIUPIy8IqJdQuuONXpAnNLoOdGuf7fuC3RKyMySkJ3eqSwsblo8.B5_Fi3Y0VDRwn5grPbtgdnJOZulbPGd23U</sessionId></SessionHeader></env:Header><env:Body><readMetadata xmlns="http://soap.sforce.com/2006/04/metadata"><type>Layout</type><fullNames>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullNames></readMetadata></env:Body></env:Envelope>
11:20:34.097 (1097997720)|CALLOUT_REQUEST|[8876]|readMetadata_element:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), field_order_type_info=(type_x, fullNames), fullNames=(TeamRaiser_Registration__c-TeamRaiser Registration Layout), fullNames_type_info=(fullNames, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), type_x=Layout, type_x_type_info=(type, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false)]::SFDC_STACK_DEPTH=1 SOAPAction="" User-Agent=SFDC-Callout/33.0 Accept=text/xml Content-Type=text/xml; charset=UTF-8 
11:20:34.244 (1244536577)|CALLOUT_RESPONSE|[8876]|<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><readMetadataResponse><result><records xsi:type="Layout"><fullName>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullName><excludeButtons>Submit</excludeButtons><layoutSections><customLabel>true</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>TeamRaiser Progress</label><layoutColumns><layoutItems><height>420</height><page>TeamRaiserProgressWidget</page><showLabel>false</showLabel><showScrollbars>false</showScrollbars><width>100%</width></layoutItems></layoutColumns><style>OneColumn</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>false</detailHeading><editHeading>true</editHeading><label>Information</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Name</field></layoutItems><layoutItems><behavior>Required</behavior><field>Contact__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participation_Type__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participant_s_Home_Page__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Registration_Date__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Opportunity__c</field></layoutItems><layoutItems><behavior>Required</behavior><field>TeamRaiser_Participation_Type__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Campaign__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team_Captain__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Fundraising_Goal__c</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Separator</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Registration_Fee__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Total_Raised__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Extra_Gift__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Upsell_Amount__c</field></layoutItems></layoutColumns><style>TwoColumnsLeftToRight</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>System Information</label><layoutColumns><layoutItems><behavior>Readonly</behavior><field>CreatedById</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Readonly</behavior><field>LastModifiedById</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Custom Links</label><layoutColumns/><layoutColumns/><layoutColumns/><style>CustomLinks</style></layoutSections><relatedLists><fields>OPPORTUNITY.NAME</fields><fields>ACCOUNT.NAME</fields><fields>OPPORTUNITY.CLOSE_DATE</fields><fields>OPPORTUNITY.AMOUNT</fields><relatedList>Opportunity.TeamRaiser_Registration__c</relatedList></relatedLists><relatedLists><fields>NAME</fields><fields>Upsell_Item__c</fields><fields>Item_Price__c</fields><fields>Item_Quantity__c</fields><fields>Total_Amount__c</fields><fields>Date_Fulfilled__c</fields><relatedList>TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c</relatedList></relatedLists><showEmailCheckbox>false</showEmailCheckbox><showHighlightsPanel>false</showHighlightsPanel><showInteractionLogPanel>false</showInteractionLogPanel><showRunAssignmentRulesCheckbox>false</showRunAssignmentRulesCheckbox><showSubmitAndAttachButton>false</showSubmitAndAttachButton><summaryLayout><masterLabel>00hE0000001CHzf</masterLabel><sizeX>4</sizeX><sizeY>0</sizeY><summaryLayoutStyle>Default</summaryLayoutStyle></summaryLayout></records></result></readMetadataResponse></soapenv:Body></soapenv:Envelope>
11:20:34.266 (1266955858)|CONSTRUCTOR_ENTRY|[4077]|01po0000003Oh7D|<init>()
11:20:34.267 (1267093655)|CONSTRUCTOR_EXIT|[4077]|01po0000003Oh7D|<init>()
11:20:34.282 (1282433396)|CALLOUT_RESPONSE|[8876]|
11:20:34.282 (1282567995)|METHOD_ENTRY|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:20:34.282 (1282592703)|METHOD_EXIT|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:20:34.282 (1282601423)|METHOD_EXIT|[11]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:20:34.282 (1282617208)|METHOD_ENTRY|[11]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:20:34.282 (1282628839)|METHOD_EXIT|[11]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:20:34.282 (1282703968)|METHOD_ENTRY|[14]|01po0000003nulZ|FeatureUpgrades.addFundraisingGoalToLayout(MetadataService.Layout)
11:20:34.282 (1282727604)|CONSTRUCTOR_ENTRY|[21]|01po0000003Oh7D|<init>()
11:20:34.282 (1282868532)|CONSTRUCTOR_EXIT|[21]|01po0000003Oh7D|<init>()
11:20:34.282 (1282881392)|METHOD_ENTRY|[22]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.282 (1282908556)|METHOD_EXIT|[22]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.282 (1282968327)|METHOD_ENTRY|[23]|01po0000003Oh7F|MetadataUtils.addFieldsToLayout(MetadataService.Layout, String, List<MetadataService.LayoutItem>, Integer)
11:20:34.282 (1282990168)|METHOD_ENTRY|[370]|01po0000003Oh7F|MetadataUtils.getFieldsNotOnLayout(MetadataService.Layout, List<MetadataService.LayoutItem>)
11:20:34.283 (1283221400)|METHOD_ENTRY|[408]|01po0000003Oh7F|MetadataUtils.isFieldInLayout(String, MetadataService.Layout)
11:20:34.283 (1283932216)|METHOD_EXIT|[408]|01po0000003Oh7F|MetadataUtils.isFieldInLayout(String, MetadataService.Layout)
11:20:34.283 (1283954945)|METHOD_EXIT|[370]|01po0000003Oh7F|MetadataUtils.getFieldsNotOnLayout(MetadataService.Layout, List<MetadataService.LayoutItem>)
11:20:34.283 (1283970285)|CONSTRUCTOR_ENTRY|[372]|01po0000003Oh7D|<init>()
11:20:34.284 (1284055520)|CONSTRUCTOR_EXIT|[372]|01po0000003Oh7D|<init>()
11:20:34.284 (1284068713)|CONSTRUCTOR_ENTRY|[373]|01po0000003Oh7D|<init>()
11:20:34.284 (1284122020)|CONSTRUCTOR_EXIT|[373]|01po0000003Oh7D|<init>()
11:20:34.284 (1284300492)|METHOD_EXIT|[23]|01po0000003Oh7F|MetadataUtils.addFieldsToLayout(MetadataService.Layout, String, List<MetadataService.LayoutItem>, Integer)
11:20:34.284 (1284308849)|METHOD_EXIT|[14]|01po0000003nulZ|FeatureUpgrades.addFundraisingGoalToLayout(MetadataService.Layout)
11:20:34.284 (1284347555)|METHOD_ENTRY|[15]|01po0000003nulZ|FeatureUpgrades.addTrProgressWidgetToLayout(MetadataService.Layout)
11:20:34.284 (1284383943)|METHOD_ENTRY|[63]|01po0000003nulZ|FeatureUpgrades.getTrProgressWidgetLayoutSection()
11:20:34.284 (1284398335)|CONSTRUCTOR_ENTRY|[44]|01po0000003Oh7D|<init>()
11:20:34.284 (1284475642)|CONSTRUCTOR_EXIT|[44]|01po0000003Oh7D|<init>()
11:20:34.284 (1284493510)|CONSTRUCTOR_ENTRY|[49]|01po0000003Oh7D|<init>()
11:20:34.284 (1284574039)|CONSTRUCTOR_EXIT|[49]|01po0000003Oh7D|<init>()
11:20:34.284 (1284584696)|CONSTRUCTOR_ENTRY|[50]|01po0000003Oh7D|<init>()
11:20:34.284 (1284717736)|CONSTRUCTOR_EXIT|[50]|01po0000003Oh7D|<init>()
11:20:34.284 (1284732654)|METHOD_ENTRY|[52]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.284 (1284754837)|METHOD_EXIT|[52]|01po0000000dllI|Utils.addNamespace(String)
11:20:34.284 (1284808318)|METHOD_EXIT|[63]|01po0000003nulZ|FeatureUpgrades.getTrProgressWidgetLayoutSection()
11:20:34.284 (1284825302)|METHOD_ENTRY|[63]|01po0000003Oh7F|MetadataUtils.addSectionToLayouts(List<MetadataService.Layout>, MetadataService.LayoutSection, Integer)
11:20:34.284 (1284948456)|METHOD_ENTRY|[588]|01po0000003Oh7F|MetadataUtils.getSectionFromLayout(String, MetadataService.Layout)
11:20:34.285 (1285038124)|METHOD_EXIT|[588]|01po0000003Oh7F|MetadataUtils.getSectionFromLayout(String, MetadataService.Layout)
11:20:34.285 (1285061843)|METHOD_EXIT|[63]|01po0000003Oh7F|MetadataUtils.addSectionToLayouts(List<MetadataService.Layout>, MetadataService.LayoutSection, Integer)
11:20:34.285 (1285068564)|METHOD_EXIT|[15]|01po0000003nulZ|FeatureUpgrades.addTrProgressWidgetToLayout(MetadataService.Layout)
11:20:34.285 (1285084300)|METHOD_ENTRY|[17]|01po0000003Oh7F|MetadataUtils.processSaveLayouts(MetadataService.MetadataPort)
11:20:34.287 (1287800448)|METHOD_ENTRY|[456]|01po0000003Oh7F|MetadataUtils.processSaveResults(List<MetadataService.SaveResult>)
11:20:34.287 (1287958322)|METHOD_EXIT|[456]|01po0000003Oh7F|MetadataUtils.processSaveResults(List<MetadataService.SaveResult>)
11:20:34.287 (1287967120)|METHOD_EXIT|[17]|01po0000003Oh7F|MetadataUtils.processSaveLayouts(MetadataService.MetadataPort)
11:20:34.287 (1287973613)|METHOD_EXIT|[1]|01po0000003nulZ|FeatureUpgrades.doFeatureUpgrades12_11()
11:20:34.324 (1290497596)|CUMULATIVE_LIMIT_USAGE
11:20:34.324|LIMIT_USAGE_FOR_NS|(default)|
  Number of SOQL queries: 0 out of 100
  Number of query rows: 0 out of 50000
  Number of SOSL queries: 0 out of 20
  Number of DML statements: 0 out of 150
  Number of DML rows: 0 out of 10000
  Maximum CPU time: 0 out of 10000
  Maximum heap size: 0 out of 6000000
  Number of callouts: 1 out of 100
  Number of Email Invocations: 0 out of 10
  Number of future calls: 0 out of 50
  Number of queueable jobs added to the queue: 0 out of 50
  Number of Mobile Apex push calls: 0 out of 10

11:20:34.324|CUMULATIVE_LIMIT_USAGE_END

11:20:34.290 (1290532080)|CODE_UNIT_FINISHED|execute_anonymous_apex
11:20:34.291 (1291659650)|EXECUTION_FINISHED